blog/2017/03/20/emacs-and-me/index.html
<!DOCTYPE html>
<html lang="en-us">
  <head>
    <title>Emacs 学习之路 - 行走的西葫芦</title>
    <meta charset="utf-8" />
    <meta name="author" content="Dylan Yang" />
    <meta name="description" content="Emacs 的使用过程，就像是程序员的生涯一样——路漫漫其修远兮，吾将上下而求索。" />
    <meta name="keywords" content="Emacs, 编辑器" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <link rel="stylesheet" href="/media/css/main.css" type="text/css">
    <link rel="stylesheet" href="/media/css/prettify-solarized-light.css" type="text/css">
    <link href="https://cdn.bootcss.com/font-awesome/4.7.0/css/font-awesome.min.css" rel="stylesheet">
  </head>

  <body class="container">
    <div>
      <header class="masthead">
        <form method="get" id="searchform" action="//www.google.com/search">
          <input type="text" class="field" name="q" id="s" placeholder="Search">
          <input type="hidden" name="as_sitesearch" value="zucchiniY.github.io">
        </form>
        <h1 class="masthead-title"><a href="/">行走的西葫芦</a></h1>
        <p>世事洞明皆学问，人情练达即文章。</p>
        <ul>
          <li><a href="/blog/"><i class="fa fa-archive"></i>Blog</a></li>
          <li><a href="/notes/"><i class="fa fa-archive"></i>Notes</a></li>
          <li><a href="/tags/"><i class="fa fa-tag"></i>Tags</a></li>
          <li><a href="/about/"><i class="fa fa-user"></i>About</a></li>
          <li><a href="https://github.com/ZucchiniY"><i class="fa fa-github"></i>GitHub</a></li>
          <li><a href="/rss.xml"><i class="fa fa-rss-square"></i>RSS</a></li>
        </ul>
      </header>
    </div>

<div>
<div class="post">
<h1>Emacs 学习之路</h1>

<div id="outline-container-org7678c4a" class="outline-2">
<h2 id="org7678c4a">万物始于 Emacs</h2>
<div class="outline-text-2" id="text-org7678c4a">
<p>
最早知道 Emacs 是从编辑器的圣战开始的，即编辑器之神——Vi，和神的编辑器——Emacs。两个编辑器在经历了几十年的战争之后，仍然是编辑世界不可超越的高峰。
</p>

<p>
但在一开始，我选择的是 Vi，因为在 *nix 中，基本都是有的，在服务器编辑文件——即使是很大的文件，Vi 也可以非常容易的使用，所以在一段时间内，我几乎是跪着使用 Vi 的。
</p>

<p>
后来随着想用的功能越来越多，而被一些大神安利，我就选择了使用 Emacs 来
记笔记（装逼）。
于是下载了当时正流行的 <code>Purcell</code> 大神的配置，并开始尝试使用，不过没过多少就放弃了。
</p>

<p>
推荐内容：
</p>

<ul class="org-ul">
<li><a href="https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org">《一年成为 Emacs 高手（像神一样使用编辑器）》</a></li>
<li><a href="https://github.com/bbatsov/prelude">Prelude 入门级 Emacs 配置</a></li>
<li><a href="https://github.com/purcell/emacs.d">Purcell 大神的配置</a></li>
</ul>
</div>
</div>

<div id="outline-container-org834a277" class="outline-2">
<h2 id="org834a277">Emacs 始于 Org</h2>
<div class="outline-text-2" id="text-org834a277">
<p>
<code>Emacs</code> 学习的无疾而终，让我的装逼大计一度沉沦。直到我看到另外两个大神，利用 <code>Org-mode</code> 进行博客写作日程管理，并详细阅读了他们的文章之后，才真正开始了 <code>Emacs</code> 的学习苦旅。
</p>

<p>
如果说 <code>Emacs</code> 是神的编辑器的话， <code>Org</code> 可能是神器之中的神器，随着对 <code>Org</code> 的学习和使用，我从最初的装逼，到后来的逼格提升，都是因为 <code>Org-mode</code> 。
</p>

<p>
推荐内容：
</p>

<ul class="org-ul">
<li><a href="https://github.com/mudan/mudan.github.io/blob/master/Emacs/The_Org_Manual/The_Org_Manual.org">mudan 大神的 Org-mode 入门级手册</a></li>
<li><a href="https://github.com/mudan/mudan.github.io/blob/master/read/dx.org">mudan 大神的漂亮的文言文排版</a></li>
<li><a href="http://forrestchang.com/14824097554043.html">Tisoga 大神的 Org + GitHub 的博客教学</a></li>
</ul>
</div>
</div>

<div id="outline-container-org530b9b0" class="outline-2">
<h2 id="org530b9b0">终于 Spacemacs 的战争</h2>
<div class="outline-text-2" id="text-org530b9b0">
<p>
从最开始的学习，到现在已经习惯于使用 Emacs 的人来说，Emacs 确实是可以提升工具效率的，当然这里要把配置他的时间拿走。
虽然开始使用的原因有所不同，但是大家最后的目标却都是一样的——提高工作（学习）效率。
</p>

<p>
但是经过了 Emacs 几次配置之后，虽然说不上大神，也就知道了一些 Emacs 的坑是如何解决的。
</p>

<p>
后来加入了一个 Emacs 的微信群——毫不夸张的说，这是我加入过的群里面质量最高的，学习效果最好的，而且所有的成员都自发的维护群里的闲聊问题，每一次讨论都是提问解决和讨论的过程。
</p>

<p>
在偶然的一次机会，被安利了一把 Spacemacs，Vi 的操作加上 Emacs 的扩展，不要太吸引人！
</p>

<p>
推荐关注的大神：
</p>

<ul class="org-ul">
<li><a href="https://github.com/hick">Hick</a> 高质量 <code>Emacs</code> 微信群群主，应该也是发起人，水的人自觉加入闲聊群，是我所有技术相关微信群中质量最高的。</li>
<li><a href="https://github.com/zilongshanren">子龙山人</a> <code>Spacemacs Rock</code> 视频作者，我的配置里抄的最多的就是这位大神的。</li>
<li><a href="https://github.com/lujun9972">DarkSun</a> 黑日大神，大神的文章非常好，多读读，可以找到一些自己需要的配置。</li>
<li><a href="https://github.com/tumashu">tumashu</a> 天然二呆，呆神，之前看到呆神在闲聊群里水，后来又看到呆神在帮忙解决问题，好奇的关注了一下 <code>GitHub</code> ，才发现，竟然这几个好用的 package
都是呆神写的，而且呆神竟然不是程序员！</li>
<li><a href="https://github.com/appleshan">appleshan</a> 大神，主要使用 spacemacs 而且是 Linux 下的，我的很多配置是从他这里抄来的，大家有需要也可以来借鉴一下。</li>
</ul>

<p>
大神太多了，不一一推荐，如果需要，可以联系 Hick 加一下群，就都有了。
</p>

<p>
再推荐一下中文的 Emacs 论坛，可以提问，也可以讨论：
</p>

<ul class="org-ul">
<li><a href="https://emacs-china.org">Emacs China</a> 一堆大神在维护的论坛，经常看看，非常好用</li>
</ul>
</div>
</div>

<div id="outline-container-org9504c6f" class="outline-2">
<h2 id="org9504c6f">语乱的 Spacemacs 配置</h2>
<div class="outline-text-2" id="text-org9504c6f">
</div>
<div id="outline-container-org43dd001" class="outline-3">
<h3 id="org43dd001">初始</h3>
<div class="outline-text-3" id="text-org43dd001">
<p>
为了更好管理配置，推荐使用 <code>.spacemacs.d</code> 文件夹进行管理配置，而不是使用
<code>.spacemacs</code> 文件。也为了方便后续的扩展。
</p>
</div>
</div>

<div id="outline-container-org9385338" class="outline-3">
<h3 id="org9385338">配置说明</h3>
<div class="outline-text-3" id="text-org9385338">
<p>
目前我的所有配置都放在 <code>github.com</code> 进行托管，目前主要增加了三个配置
</p>

<p>
<a href="https://github.com/AboutEmacs/.spacemacs.d">我的配置</a>
</p>

<ol class="org-ol">
<li>zucchini : 主要用来管理私有配置和全局快捷键</li>
<li>zucchini-lisp : 主要用来配置 <i>elisp</i> 相关内容</li>
<li>zucchini-org : 主要用来配置最常使用的 <i>org-mode</i></li>
</ol>
</div>
</div>

<div id="outline-container-orgd38b932" class="outline-3">
<h3 id="orgd38b932">可能会遇到的问题</h3>
<div class="outline-text-3" id="text-orgd38b932">
<ul class="org-ul">
<li>如果是在 Windows 下使用，需要注意几个问题：

<ul class="org-ul">
<li>推荐用编译版本，或者用官方网站加部分 <code>.dll</code> 文件来解决</li>
<li>使用过程中，为了配置的时候好用（更适合 Linux），我是使用在环境变量
中增加默认的 <code>HOME</code> 的方案，也可以使用其它方法</li>
<li>直接下载就可以使用，维护的是 <code>develop</code> 分支，后续会慢慢往 <b>master</b>
分支中合并</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org84c7acf" class="outline-3">
<h3 id="org84c7acf">最终选择</h3>
<div class="outline-text-3" id="text-org84c7acf">
<ul class="org-ul">
<li>在几经周折之后，最后还是选择自己从头开始配置一套 <code>.emacs.d</code> 的内容，但
是 <code>.spacemacs.d</code> 的相关内容也没有清楚。</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org31811d0" class="outline-2">
<h2 id="org31811d0">我的博客地址</h2>
<div class="outline-text-2" id="text-org31811d0">
<ul class="org-ul">
<li>coding 访问：<a href="https://yuluanchunqiu.coding.me">https://yuluanchunqiu.coding.me</a> 如果使用 chrome 访问需要加载不安全的插件。</li>
</ul>
</div>
</div>

</div>
</div>
    <div>
      <div class="post-meta">
        <span title="post date" class="post-info">2017-03-20</span>
        <span title="last modification date" class="post-info">2018-02-04</span>
        <span title="tags" class="post-info"><a href="/tags/emacs/">Emacs</a></span>
        <span title="author" class="post-info">Dylan Yang</span>
      </div>
      <script src="//code.jquery.com/jquery-latest.min.js"></script>
      <script src="https://cdnjs.cloudflare.com/ajax/libs/prettify/r298/prettify.js"></script>
      <script src="https://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML"></script>
      <script src="//cdn.bootcss.com/canvas-nest.js/1.0.1/canvas-nest.min.js"></script>
      <script src="/media/js/main.js"></script>
      <div class="footer">
        <p>Generated by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.x (<a href="http://orgmode.org">Org mode</a> 9.x)</p>
        <p>
          Copyright &copy; 2012 - <span id="footerYear"></span> <a href="mailto:banshiliuli1990 &lt;at&gt; sina &lt;dot&gt; com">Dylan Yang</a>
          &nbsp;&nbsp;-&nbsp;&nbsp;
          Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
          <script type="text/javascript">document.getElementById("footerYear").innerHTML = (new Date()).getFullYear();</script>
        </p>
      </div>
    </div>

  </body>
</html>
